# YOLOv5s 热红外 - Exp2 (GhostC3)
# 消融实验 Exp2: + 轻量化骨干网络

nc: 1
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10, 13, 16, 30, 33, 23]
  - [30, 61, 62, 45, 59, 119]
  - [116, 90, 156, 198, 373, 326]

backbone:
  [[-1, 1, Focus, [64, 3]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, GhostC3, [128]],                # ✅ 改为GhostC3
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 9, GhostC3, [256]],                # ✅ 改为GhostC3
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, GhostC3, [512]],                # ✅ 改为GhostC3
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, GhostC3, [1024, False]],        # ✅ 改为GhostC3
  ]

neck:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, GhostC3, [512, False]],         # ✅ 改为GhostC3

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, GhostC3, [256, False]],         # ✅ 改为GhostC3

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],
   [-1, 1, GhostC3, [128, False]],         # ✅ 改为GhostC3

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -1], 1, Concat, [1]],
   [-1, 3, GhostC3, [256, False]],         # ✅ 改为GhostC3

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -1], 1, Concat, [1]],
   [-1, 3, GhostC3, [512, False]],         # ✅ 改为GhostC3
  ]

head:
  [[-1, (3, 6, 9), Detect, [nc, anchors]],
  ]