# YOLOv5s 红外目标检测配置
# 针对红外图像特点优化的模型配置

# 模型参数
nc: 3  # 类别数量 (person, car, bicycle)
depth_multiple: 0.33  # 模型深度系数
width_multiple: 0.50  # 模型宽度系数

# 锚框配置 (针对红外目标尺寸优化)
anchors:
  - [10, 13, 16, 30, 33, 23]     # P3/8  小目标
  - [30, 61, 62, 45, 59, 119]    # P4/16 中目标  
  - [116, 90, 156, 198, 373, 326]  # P5/32 大目标

# 骨干网络 (Backbone)
backbone:
  # [from, number, module, args]
  # 输入: 640x640x3
  [
    [-1, 1, Focus, [64, 3]],           # 0-P1/2  320x320x64
    [-1, 1, Conv, [128, 3, 2]],        # 1-P2/4  160x160x128
    [-1, 3, C3, [128]],                # 2       160x160x128
    [-1, 1, Conv, [256, 3, 2]],        # 3-P3/8  80x80x256
    [-1, 9, C3, [256]],                # 4       80x80x256
    [-1, 1, Conv, [512, 3, 2]],        # 5-P4/16 40x40x512
    [-1, 9, C3, [512]],                # 6       40x40x512
    [-1, 1, Conv, [1024, 3, 2]],       # 7-P5/32 20x20x1024
    [-1, 1, SPP, [1024, [5, 9, 13]]],  # 8       20x20x1024
    [-1, 3, C3, [1024, False]],        # 9       20x20x1024
  ]

# 颈部网络 (Neck) - PANet结构
neck:
  [
    [-1, 1, Conv, [512, 1, 1]],        # 10      20x20x512
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11 40x40x512
    [[-1, 6], 1, Concat, [1]],         # 12      40x40x1024
    [-1, 3, C3, [512, False]],         # 13      40x40x512

    [-1, 1, Conv, [256, 1, 1]],        # 14      40x40x256
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15 80x80x256
    [[-1, 4], 1, Concat, [1]],         # 16      80x80x512
    [-1, 3, C3, [256, False]],         # 17      80x80x256  (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],        # 18      40x40x256
    [[-1, 14], 1, Concat, [1]],        # 19      40x40x512
    [-1, 3, C3, [512, False]],         # 20      40x40x512  (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],        # 21      20x20x512
    [[-1, 10], 1, Concat, [1]],        # 22      20x20x1024
    [-1, 3, C3, [1024, False]],        # 23      20x20x1024 (P5/32-large)
  ]

# 检测头 (Head)
head:
  [
    [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
